[{"accession":"0000001","name":"AMR detection models","definition":"The Comprehensive Antibiotic Resistance Database uses models and model parameters for recording and detection of molecular determinants of antimicrobial resistance. For example, the \"protein homolog\" model type contains sequences of antimicrobial resistance genes that do not include mutation as a determinant of resistance, whereas the \"protein variant\" model includes reference wild type sequences used for mapping SNPs conferring antimicrobial resistance. "},{"accession":"0000002","name":"protein variant model","definition":"A model to detect proteins that confer elevated resistance to antibiotic(s) relative to wild type. These models include reference sequences (which may or may not be a wild type sequence), a curated BLASTP cut-off, and mapped resistance variants."},{"accession":"0000003","name":"BLASTP e-value","definition":"A curated expectation value (e-value) for assignment of an Antibiotic Resistance Ontology term based on a BLASTP hit to a CARD reference sequence."},{"accession":"0000004","name":"single resistance variant","definition":"A mutation or sequence variant that confers elevated resistance to antibiotic(s) relative to wild type. The most common encoded in the CARD is an amino acid substitution gleaned from the literature with format [wild-type][position][mutation], e.g. R184Q. Single or multiple amino acid substitutions can be present in a single gene or across multiple genes to confer resistance to antibiotic(s). In addition, there are insertions and deletions within genome sequences that confer elevated resistance towards antibiotic(s)."},{"accession":"0000005","name":"protein wild type model","definition":"A model to detect wild type proteins that are sensitive to antibiotic(s). These models are in development."},{"accession":"0000006","name":"rRNA mutation model","definition":"A model to detect mutations in ribosomal RNA genes (rRNA) that confer elevated resistance to antibiotic(s) relative to wild type. These models include a reference rRNA sequence and mapped resistance variants."},{"accession":"0000007","name":"gene order","definition":"A parameter to describe the relative order of genes detected by multiple detection models. The parameter is defined by a series of model_id separated by commas."},{"accession":"0000008","name":"gene order model","definition":"A meta-model to detect a defined gene order based on gene detection by other models."},{"accession":"0000009","name":"protein homolog model","definition":"Models to detect proteins conferring antibiotic resistance, which include a reference protein sequence and a curated BLASTP cut-off."},{"accession":"0000010","name":"protein domain model","definition":"A model to detect specific domains of proteins that confer resistance to antibiotic(s) relative to wild type. These models include reference sequences, a curated BLASTP cut-off for each of the genes, and directionality of the fused genes (if known)."},{"accession":"0000011","name":"domain order","definition":"A parameter to describe the genes in a fusion protein. The parameter is defined by Cvterm IDs, separated by commas. "},{"accession":"0000012","name":"domain direction or strand","definition":"A parameter to describe the order of the fusion protein domains from N terminus to C terminus. The parameter is defined by Cvterm IDs separated by commas (if known). "},{"accession":"0000013","name":"multiple gene mutations model","definition":"A model to detect specific mutation(s) in different genes that confer elevated resistance to antibiotic(s) relative to wild type. These models include reference sequences, a curated BLASTP cut-off, and mapped mutations in each gene."},{"accession":"0000014","name":"multiple resistance variants","definition":"A parameter to describe the gene and the mapped mutation(s) within that gene. The parameter is described by the CVterm ID and the mutation(s) with format [wild-type][position][mutation], separated by commas. "},{"accession":"0000015","name":"single gene multiple mutations model","definition":"A model to detect multiple mutations in a single gene that confer elevated resistance to antibiotic(s) relative to wild type. These models include reference sequences, a curated BLASTP cut-off, and mapped mutations."},{"accession":"0000016","name":"single gene multiple mutations","definition":"A parameter to describe the mapped mutations within a single gene. The parameter is described by a series of mutations with with format [wild-type][position][mutation], separated by commas."},{"accession":"0000017","name":"deletion model","definition":"A model to detect genetic deletions that confer elevated resistance to antibiotic(s) relative to wild type. These models include reference sequences, a curated BLASTP cut-off, and mapped deletions."},{"accession":"0000018","name":"insertion \/ deletion","definition":"A parameter to describe the mapped insertion or deletion. For an insertion: insert the location and genetic sequence of the insertion. For a deletion: insert the location of the deletion. For nucleotide space: insertion:  [nt][position]+[number of nucleotides]:[nucleotides] eg. nt312+1:G. For protein space: insertion: +[amino acids][start position-end position] eg. +S312. If both are known, a \"\/\" may be used to separate the protein and nucleotide notation eg. nt312+3:AGC\/+S312."},{"accession":"0000019","name":"insertion model","definition":"A model to detect genetic insertions that confer elevated resistance to antibiotic(s) relative to wild type. These models include reference sequences, a curated BLASTP cut-off, and mapped insertions."},{"accession":"0000020","name":"protein knockout model","definition":"A model to detect cases where the absence of a protein due to large scale insertions or deletions confers elevated resistance to antibiotic(s). These models include reference sequences and a curated BLASTP cut-off."},{"accession":"0000021","name":"taxa restriction","definition":"A parameter to restrict the Resistance Gene Identifier search to specific taxa."},{"accession":"0000022","name":"nonsense SNP","definition":"A SNP that changes an amino acid residue to a STOP codon resulting in a truncated protein product. These mutations are recorded in the format: [wild type amino acid][position][STOP] (e.g. Q42STOP)"},{"accession":"0000023","name":"co-dependent single resistance variant","definition":"A model parameter to describe mutations in multiple genes that are dependent on each other's presence to confer resistance. For example, the G247S SNP in M. tuberculosis gyrA does not confer resistance to fluoroquinolones. However, when the D500N SNP is also present in gyrB, resistance is conferred. In this case, gyrA G247S is co-dependent on gyrB D500N to confer resistance. Notation: [cvterm-id-gene-1],[gene-1-SNP]+[cvterm-id-gene-2],[gene-2-SNP]+ ... +[cvterm-id-gene-n],[gene-n-SNP] e.g. 39879,G247S+40052,D500N"},{"accession":"0000024","name":"frameshift","definition":"Insertion or deletion causing a frameshift mutation. These may contain data on the new STOP codon location if reported in the literature. For example, the notation for a frameshift after K136 creating a new STOP codon at P167 is: K136fs;P167STOP. If new STOP is unknown, K136fs is sufficient."},{"accession":"0000025","name":"co-dependent nonsense SNP","definition":"A model parameter to describe mutations in multiple genes that are dependent on each other's presence to confer resistance. For example, a mutation to Gene A does not confer resistance, but with an additional nonsense mutation in Gene B, resistance is conferred. Notation: [cvterm-id-gene-1],[gene-1-nonsenseSNP]+[cvterm-id-gene-2],[gene-2-nonsenseSNP]+ ... +[cvterm-id-gene-n],[gene-n-nonsenseSNP] e.g. 39879,G247S+40052,D500STOP"},{"accession":"0000026","name":"co-dependent insertion\/deletion","definition":"A model parameter to describe mutations in multiple genes that are dependent on each other's presence to confer resistance. For example, a mutation to Gene A does not confer resistance, but with an additional deletion mutation in Gene B, resistance is conferred. Notation: [cvterm-id-gene-1],[gene-1-mutation]+[cvterm-id-gene-2],[gene-2-mutation]+ ... +[cvterm-id-gene-n],[gene-n-mutation], with mutation notation corresponding to the appropriate type and notation from the non-co-dependent parameter (ie. single resistance variant, insertion\/deletion and nonsense SNP) e.g. 39879,G247S+40052,nt502-1:C"},{"accession":"0000027","name":"reverse antibiotic model","definition":"The Reverse Antibiotic model applies to cases where a drug acts on a mutant form of a protein, thus counteracting conferred resistance from the mutation. An example of this is the relationship between nybomycin and quinolones: the S84L mutation in gyrA confers resistance to quinolones, but creates the required binding site for nybomycin to act on the mutant gyrA. Nybomycin in this case is therefore considered a Reverse Antibiotic (RA) as it acts on the mutant protein."},{"accession":"0000028","name":"nonfunctional insertion model","definition":"Models to detect the inclusion of a large insertion element. These insertion elements create a nonfunctional protein which confers resistance."},{"accession":"0000029","name":"BLASTP bit-score","definition":"A score is a numerical value that describes the overall quality of an alignment. Higher numbers correspond to higher similarity. The bit-score (S) is determined by the following formula: S = (λ × S − lnK)\/ ln2 where λ is the Gumble distribution constant, S is the raw alignment score, and K is a constant associated with the scoring matrix."},{"accession":"0000030","name":"plasmid stabilization protein - removed","definition":"toxin - relBE or parDE *\/PHD-RelE (From TADB)"}]